t = input("Введите температуру (например, 12C или 100F): ")
try: #нужен, чтобы программа не ломалась при неправильном вводе
    value = float(t[:-1]) #число с плавающей точкой, [:-1] - без последнего символа
    if t[-1] == "C": #проверяем последний символ
        print(round(value * 9 / 5 + 32), "F", sep="") #формула перевода из C в F, round - округление, sep="" - без пробела
    elif t[-1] == "F":
        print(round((value - 32) * 5 / 9), "C", sep="") #из F в C
    else:
        print("Ошибка ввода")
except ValueError: #что выдает try при ошибке 
    print("Ошибка ввода")